import React from 'react';
import { View, Text } from 'react-native';

export default [
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Бульвар Рамбла</Text>
        <Text>Самая знаменитая улица Испании, бульвар Рамбла протянулся от площади Каталонии до Старого порта. Здесь всегда царит оживлённая атмосфера веселья, празднеств и восхитительных тайн. Центр бульвара — пешеходный, на его мостовой расположились продавцы цветов, сувениров и сладостей и мимы, а по обеим сторонам проезжей части теснятся здания 16-18 веков: музеи, театры, доходные и жилые дома.</Text>
        <Text>Рамбла делится на 5 отрезков, каждый из которых чем-нибудь да знаменит: свернув с Рамблы Капуцинов, к примеру, можно выйти на обсаженную пальмами Королевскую площадь, Рамбла-де-Каналетес служит главным местом празднования побед футбольного клуба «Барселона», а на Рамбле Сан-Хосе можно увидеть плиточную мозаику, элемент которой несёт автограф Жоана Миро. На Рамбле располагаются такие жемчужины каталонской архитектуры, как рынок Бокерия, театр Лисео и дворец Вирейна, а ещё здесь можно посетить Музей восковых фигур и Музей эротики.</Text>
      </View>
    )
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Готический квартал</Text>

        <Text>Некогда самый центр Барселоны и средоточие всех её средневековых достопримечательностей, Готический квартал находится между Рамблой и улицей Лайетана. Несмотря на то, что множество зданий здесь датируется 14-15 веками, в Готическом квартале хватает и уютных ресторанчиков, и дорогих магазинов, и оживлённых ночных клубов. Планировка квартала представляет собой паутину узких улочек, многие из которых пешеходные, встречающихся на прямоугольных площадях, со всех сторон окруженных впритык стоящими зданиями. В числе самых симпатичных — площадь святого Хауме, ведущая историю ещё с римских времён, тенистая площадь Рейяль и уютная площадь Дель-Рей.</Text>

        <Text>Архитектурные шедевры Готического квартала — в первую очередь, великолепный Кафедральный собор 12-19 вв с массой интересных артефактов внутри (и 13 белоснежными гусями!), здание Правительства Каталонии, руины древнеримских городских стен и храма Августа, Дом архидьякона и Дворец архиепископа. Здесь же находится и Еврейский квартал с руинами Большой синагоги. Ближайшие к Готическому кварталу станции метро — Liceu и Jaume I.</Text>
      </View>
    )
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Дом Бальо</Text>

        <Text>Один из самых известных особняков, на архитектурном плане которого красуется подпись великого Гауди, дом Бальо расположился на проспекте Пасседж-де-Грасиа, в сердце квартала Эшампле. Всё в этом здании удивительно: «танцующий» фасад, украшенный разноцветными брызгами керамической мозаики, балконы, напоминающие одновременно забрала на шлемах средневековых рыцарей и китовый ус, многоцветье черепицы на крыше, в очертаниях которой можно угадать изогнувшегося диковинного дракона, «фирменные» печные трубы и витражи из цветного стекла. Когда смотришь на дом Бальо с улицы, кажется, что здание живёт, дышит и пристально следит за перемещениями своих гостей.</Text>

        <Text>Интерьер особняка не менее замечателен — здесь можно увидеть люстру-солнце, словно выходящую из пучины волн потолка, лестничные перила и мебель из «мягкого» дерева, керамическую облицовку уютного цвета линялой синьки и массу витражных вставок, светящихся цветом варенья из крыжовника.</Text>

        <Text>Приходить к дому Бальо лучше к открытию, позже очереди достигают критической длины.</Text>
      </View>)
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Дом Мила</Text>

        <Text>Дом Мила — жилой дом и памятник архитектуры... Редко эти понятия связываются воедино, но исключения бывают. Случай Дома Мила, или на испанский манер Каса-Мила, — как раз такое исключение. И ведь действительно не зря эта достопримечательность Барселоны в 1984 году стала первым сооружением 20 века, включённым в Список Всемирного наследия ЮНЕСКО.</Text>

        <Text>Сначала барселонцы не слишком высоко отзывались о новом творении Гауди. Экстравагантный дом получил прозвище «педрера», что означает каменоломня, за свой неровный и тяжеловесный фасад. Теперь Каса-Мила — общепризнанный шедевр архитектуры, без фото на его фоне не обходится ни один визит в Испанию.</Text>
      </View>)
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Кафедральный собор Барселоны</Text>

        <Text>Кафедральный собор Барселоны — удивительно красивый образец готического стиля с отчётливыми жизнеутверждающими каталонскими мотивами. Несмотря на свою массивность, провоцирующую у зрителя мысли о нерадостном Средневековье, собор может похвастать массой изящных деталей — помпезной готической «розеткой» над центральным входом, стройными колоннами и летящими ввысь шпилями-башенками. Но главные достопримечательности расположены внутри — скульптура Христа с флагмана каталонского флота, 13 белых гусей во славу святой Евлалии и головокружительные виды на Барселону с купола собора.</Text>

        <Text>Такое масштабное предприятие, как возведение Кафедрального собора Барселоны, разумеется, требовало массу средств и времени. Первых часто не хватало, и строительство останавливалось на неопределённый срок. По этой причине разные архитектурные элементы собора датируются 1298—1460 годами, а главный фасад был построен лишь в 1870 году на основе эскизов 15 века.</Text>
      </View>
    )
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Парк Гуэль</Text>

        <Text>В 1900 году Эусеби Гуэль выкупил на окраине Барселоны 62 гектара земли с целью создания города-сада, что было очень популярно в конце 19 века. Созданием инфраструктуры должен был заняться Гауди. Землю свою Гуэль разрезал на 62 участка и попытался продать под частные особняки. Проект оказался неудачным, куплено было всего 2 участка: тех, кто мог купить землю, не привлекала пустынная окраина, а те, кто согласился бы жить на окраине, не имели достаточно средств. Один из домов принадлежал великому испанскому архитектору Гауди, здесь он прожил около 20 лет, здесь сейчас находится его музей.</Text>

        <Text>Истории парка Гуэля</Text>

        <Text>В 1901 году начались работы по созданию на этой земле парка. Велись они в три этапа: вначале были укреплены и обустроены склоны холма, затем проложены подъездные дороги, построены стены и входные павильоны, а на заключительном этапе было запланировано строительство нескольких домов на проданных участках и построена знаменитая извилистая скамейка-парапет, огибающая огромную площадь-террасу. Материал для оформления скамейки собирали все рабочие всех строек, которыми занимался на тот момент Гауди.</Text>

        <Text>Им было велено подбирать повсеместно битую посуду, осколки декоративных плиток и прочий пестрый хлам, который обычно несут домой с улицы маленькие дети, за что и получают нагоняй от родителей. Но Гауди был человек взрослым, поэтому делал то, что хотел, безнаказанно. Собранными черепками выложен был парапет и лестница, ведущая на террасу.</Text>
        <Text>Другими словами, был создан первый в истории архитектуры коллаж из практически мусора, который впоследствии вдохновил многих выдающихся архитекторов на создание шедевров.</Text>
      </View>
    )
  },
  {
    content: () => (
      <View style={{flex: 1}}>
        <Text style={{fontWeight: "600"}}>Саграда Фамилия</Text>

        <Text>В каждой туристической Мекке, куда ежегодно стекаются тысячи любознательных паломников со всего света, есть свое ассоциативное сооружение-визитка. Это самая главная достопримечательность, которая является обязательным must look’ом для каждого иностранного туриста, и без которой уже невозможно представить ту или иную страну или город. Так, только при одном упоминании о Париже моментально всплывает образ Эйфелевой башни, при виде изображения статуи свободы в сознании мигают проблесковым маячком буквы USA, а значок пирамиды Хеопса вполне может заменять собой название Египта на географической карте. Однако, пожалуй, больше ни в одной стране мира нет такой специфической особенности, которая отличает визитку испанского города Барселоны от других всемирно известных сооружений. Речь идет, разумеется, о знаменитом произведении великого архитектора Гауди, о соборе Саграда Фамилия.</Text>

        <Text>Архитектурное повествование этого автора тянется цепочкой вкладов в строительство от его последователей до наших современников. Оно дышит эхом прошлого, храня в своих стенах воспоминания минувших исторических событий, и звучит в унисон с сегодняшним 21 веком. Собор Святого Семейства — это поистине уникальное архитектурное явление, это мост, связавший поколения, эпохи и подаривший исключительную возможность не только прикоснуться к истории, но и приобщиться к ее созданию. На протяжении полутора столетий сооружение строится, растет, видоизменяется.</Text>

        <Text>И это единственный случай в истории архитектуры, когда долгострой имеет такую колоссальную мировую известность, является источником притяжения миллионов туристов и входит в список мирового наследия ЮНЕСКО.</Text>
      </View>
    )
  }
];